<?php
/*
 * This file is part of the ************************ package.
 * ##########################################################
 * #   ____                          ______  _   _ ______   #
 * #  /     \       ___  _ __  _   _ | ___ \| | | || ___ \  #
 * # |   (  ||(_)| / _ \| '__|| | | || |_/ /| |_| || |_/ /  #
 * #  \____/ |___||  __/| |   | |_| ||  __/ |  _  ||  __/   #
 * #       \__   | \___ |_|    \__  || |    | | | || |      #
 * #     Query Yet Simple      __/  |\_|    |_| |_|\_|      #
 * #                          |___ /  Since 2010.10.03      #
 * ##########################################################
 *
 * The PHP Framework For Code Poem As Free As Wind. <Query Yet Simple>
 * (c) 2010-2018 http://queryphp.com All rights reserved.
 *
 * For the full copyright and license information, please view the LICENSE
 * file that was distributed with this source code.
 */

/**
 * 国际化默认配置文件
 *
 * @author Xiangmin Liu <635750556@qq.com>
 * @package $$
 * @since 2016.11.19
 * @version 1.0
 */
return [

    /**
     * ---------------------------------------------------------------
     * 是否开启语言包
     * ---------------------------------------------------------------
     *
     * 如果你的项目需要多语言请设置为 true，否则设置为 false
     */
    'on' => true,

    /**
     * ---------------------------------------------------------------
     * 当前语言环境
     * ---------------------------------------------------------------
     *
     * 根据面向的客户设置当前的软件的语言
     */
    'default' => 'zh-cn',

    /**
     * ---------------------------------------------------------------
     * 当前开发语言环境
     * ---------------------------------------------------------------
     *
     * 如果为当前开发语言则不载入语言包直接返回
     */
    'develop' => 'zh-cn',

    /**
     * ---------------------------------------------------------------
     * 语言包扩展
     * ---------------------------------------------------------------
     *
     * 扩展语言包对应的目录，string or array
     * see mvc\application::getI18nDir
     */
    'extend' => []
];
